In [1]:
import pandas as pd
import sqlite3
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
print(5 and 10)

10

In [3]:
2+3*2

8

In [4]:
("XERGIOK".lower())

'xergiok'

In [5]:
a = [1, 2, 3, 4, 5, 6, 7]
print(a[1:6:-1])

[]

In [6]:
print(4%3)

1

In [9]:
result = np.int64(5/3)
print(result)

1

In [11]:
np.absolute(result)

1

In [13]:
print(round(232343.54736472863))

232344

In [14]:
df = pd.read_csv("/Users/thomassimmons/c/ds/titanic.csv")

In [15]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [19]:
df['Age'].fillna(df['Age'].median(), inplace=True)

In [20]:
df['Age'] = df['Age'].astype('int64')